In [2]:
import pandas as pd
data=[1,2,34,5]
series=pd.Series(data)
print(series)

0     1
1     2
2    34
3     5
dtype: int64

In [3]:
a=[3,6,0]
myvar=pd.Series(a,index=["a","b","c"])
print(myvar)

a    3
b    6
c    0
dtype: int64

In [4]:
import numpy as np
print("series=\n",series)
series_sqrt=np.sqrt(series)
print("\nSeries after Applying Square Root:\n",series_sqrt)

series=
 0     1
1     2
2    34
3     5
dtype: int64

Series after Applying Square Root:
 0    1.000000
1    1.414214
2    5.830952
3    2.236068
dtype: float64

In [10]:
import pandas as pd
data={
    "calories": [230,470,900],
    "duration": [30,60,80]
}
df=pd.DataFrame(data)
print(df)

   calories  duration
0       230        30
1       470        60
2       900        80

In [14]:
data={'state': ['Ohio','Ohio','Ohio','Neveda','Neveda','Neveda'],
'year': [2000,2001,2002,2001,2002,2003],
'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
print(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Neveda  2001  2.4
4  Neveda  2002  2.9
5  Neveda  2003  3.2

In [17]:
frame=pd.DataFrame(data, columns=['year', 'state', 'pop'])
print(frame)

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9
5  2003  Neveda  3.2

In [18]:
frame2=pd.DataFrame(data,columns=['year', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five', 'six'])
print(frame2)

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Neveda  2.4  NaN
five   2002  Neveda  2.9  NaN
six    2003  Neveda  3.2  NaN

In [19]:
print(frame2['year'])

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [22]:
print(frame2.loc['one'])

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [23]:
print(frame2.loc[['two', 'three']])

       year state  pop debt
two    2001  Ohio  1.7  NaN
three  2002  Ohio  3.6  NaN

In [24]:
frame2['debt'] = 12.4
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5  12.4
two    2001    Ohio  1.7  12.4
three  2002    Ohio  3.6  12.4
four   2001  Neveda  2.4  12.4
five   2002  Neveda  2.9  12.4
six    2003  Neveda  3.2  12.4

In [25]:
import numpy as np
frame2['debt']=np.arange(6.)
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Neveda  2.4   3.0
five   2002  Neveda  2.9   4.0
six    2003  Neveda  3.2   5.0

In [26]:
val=pd.Series([-1.2,-1.5,-1.7], index=['two', 'four', 'five'])
print(frame2)

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Neveda  2.4   3.0
five   2002  Neveda  2.9   4.0
six    2003  Neveda  3.2   5.0

In [27]:
obj=pd.Series([4.5,7.2,-5.3,3.6], index=['d', 'b', 'a', 'c'])
print(obj)
obj2=obj.reindex(['a','b','c','d','e'])
obj2

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [33]:
obj3=pd.Series(['blue','purple','yellow'], index=[0,2,4])
print(obj3)
obj4=obj3.reindex(range(6),method='ffill')
obj4

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [34]:
obj=pd.Series(np.arange(5.), index=['a','b','c','d','e'])
new_obj=obj.drop('c')
print(new_obj)
obj.drop(['d','c'])

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

a    0.0
b    1.0
e    4.0
dtype: float64

In [35]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio','Dallas','NJ','New York'],
                 columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Dallas      4    5      6     7
NJ          8    9     10    11
New York   12   13     14    15

In [36]:
data=pd.DataFrame(np.arange(24).reshape((6,4)),
                 index=['Ohio', 'Dallas', 'Boston', 'NJ', 'New York', 'Austin'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Dallas      4    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23

In [37]:
data['two']

Ohio         1
Dallas       5
Boston       9
NJ          13
New York    17
Austin      21
Name: two, dtype: int32

In [38]:
data[1:5]

          one  two  three  four
Dallas      4    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19

In [39]:
data.loc['Dallas', ['two', 'three']]

two      5
three    6
Name: Dallas, dtype: int32

In [40]:
data.at['Dallas', 'one']

4

In [41]:
print(data.three>5)
data[data.three>5]

Ohio        False
Dallas       True
Boston       True
NJ           True
New York     True
Austin       True
Name: three, dtype: bool

          one  two  three  four
Dallas      4    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23

In [42]:
data<5
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Dallas      0    5      6     7
Boston      8    9     10    11
NJ         12   13     14    15
New York   16   17     18    19
Austin     20   21     22    23